In [1]:
import pandas as pd

In [2]:
df_1 = pd.read_csv('data/PV_Live Historic Results.csv')

In [3]:
df_1.head()

,ggd_id,datetime_gmt,n_ggds,generation_mw,lcl_mw,ucl_mw,installedcapacity_mwp,capacity_mwp
0,0,2021-06-30T03:30:00Z,1,0.025,0.0,0.0663,13080.0,12390.0
1,0,2021-06-30T03:00:00Z,1,0.946,0.0,2.4700,13080.0,12390.0
2,0,2021-06-30T02:30:00Z,1,0.839,0.0,2.1000,13080.0,12390.0
3,0,2021-06-30T02:00:00Z,1,1.600,0.0,4.1300,13080.0,12390.0
4,0,2021-06-30T01:30:00Z,1,0.359,0.0,0.9150,13080.0,12390.0

In [11]:
df_1.columns

Index(['ggd_id', 'datetime_gmt', 'n_ggds', 'generation_mw', 'lcl_mw', 'ucl_mw',
       'installedcapacity_mwp', 'capacity_mwp'],
      dtype='object')

In [23]:
print(" \nCount total NaN at each column in a DataFrame : \n\n", df_1.isnull().sum())

Count total NaN at each column in a DataFrame :

 ggd_id                      0
datetime_gmt                0
n_ggds                      0
generation_mw               0
lcl_mw                   3912
ucl_mw                   3912
installedcapacity_mwp       0
capacity_mwp                0
dtype: int64

In [4]:
df_2 = pd.read_csv('data/gridwatch.csv')

In [5]:
df_2.head()

,id,timestamp,demand,frequency,coal,nuclear,ccgt,wind,pumped,hydro,...,ocgt,french_ict,dutch_ict,irish_ict,ew_ict,nemo,other,north_south,scotland_england,ifa2
0,4,2011-05-27 15:50:04,38874,50.132000,9316,8221,18239,1253,309,636,...,0,912,0.0,-414,0.0,0,0,0,0,0
1,5,2011-05-27 15:55:02,38845,50.091000,9294,8225,18158,1304,332,633,...,0,912,0.0,-414,0.0,0,0,0,0,0
2,6,2011-05-27 16:00:02,38745,50.034000,9270,8224,18110,1322,285,634,...,0,912,0.0,-414,0.0,0,0,0,0,0
3,7,2011-05-27 16:05:01,38826,49.990002,9262,8220,18114,1364,287,635,...,0,900,0.0,-414,0.0,0,0,0,0,0
4,8,2011-05-27 16:10:02,38865,50.016998,9256,8210,18107,1370,297,637,...,0,900,0.0,-414,0.0,0,0,0,0,0

In [10]:
df_2.columns

Index(['id', ' timestamp', ' demand', ' frequency', ' coal', ' nuclear',
       ' ccgt', ' wind', ' pumped', ' hydro', ' biomass', ' oil', ' solar',
       ' ocgt', ' french_ict', ' dutch_ict', ' irish_ict', ' ew_ict', ' nemo',
       ' other', ' north_south', ' scotland_england', ' ifa2'],
      dtype='object')

In [21]:
df_2.dtypes

id                     int64
 timestamp            object
 demand                int64
 frequency           float64
 coal                  int64
 nuclear               int64
 ccgt                  int64
 wind                  int64
 pumped                int64
 hydro                 int64
 biomass               int64
 oil                   int64
 solar               float64
 ocgt                  int64
 french_ict            int64
 dutch_ict           float64
 irish_ict             int64
 ew_ict              float64
 nemo                  int64
 other                 int64
 north_south           int64
 scotland_england      int64
 ifa2                  int64
dtype: object

In [22]:
print(" \nCount total NaN at each column in a DataFrame : \n\n", df_2.isnull().sum())

Count total NaN at each column in a DataFrame :

 id                   0
 timestamp           0
 demand              0
 frequency           0
 coal                0
 nuclear             0
 ccgt                0
 wind                0
 pumped              0
 hydro               0
 biomass             0
 oil                 0
 solar               0
 ocgt                0
 french_ict          0
 dutch_ict           0
 irish_ict           0
 ew_ict              0
 nemo                0
 other               0
 north_south         0
 scotland_england    0
 ifa2                0
dtype: int64